#pragma once
#include <DirectXmath.h>

//======================================================
/// [機能] ゲームワールドのカメラの役割をするクラスです
//======================================================
class Camera {
public:
	Camera(){};
	virtual ~Camera(){};

	//-------------------------------------
	/// [機能]カメラの状態の更新
	//-------------------------------------
	virtual void Update() = 0;
	

	//-----------------------------------------
	/// [機能] カメラの位置を取得します
	/// [返り値] カメラの位置です
	//-----------------------------------------
	virtual DirectX::XMFLOAT3 GetPosition()const = 0;


	//-----------------------------------------
	/// [機能] 注視位置を取得します
	/// [返り値] 注視位置です
    //-----------------------------------------
	virtual DirectX::XMFLOAT3 GetLookPos()const = 0;

private:
	
};
