#pragma once
#include <d3dx12.h>
#include <directXmath.h>

using namespace DirectX;


//==============================================================================================
/// [出来ることリスト]
/// 3次元ベクトルの加算、減算、スカラー乗算、スカラー除算、ベクトルの長さ取得、ベクトルの正規化
/// 前方ベクトル計算、後方ベクトル計算、右方向ベクトルの計算、左方向ベクトルの計算
/// floatの絶対値取得、floatのほぼ一致の判断
//==============================================================================================



namespace Math {
	//----------------------------------------
	/// [機能]  3次元ベクトルのの加算
	/// [引数1] 左辺値
	/// [引数2] 右辺値
	/// [戻り値] 加算結果のベクトル
	//----------------------------------------
	const XMFLOAT3 Add(const XMFLOAT3& vector1,const XMFLOAT3& vector2);

	//----------------------------------------
	/// [機能]  3次元ベクトルのの加算
	/// [引数1] 左辺値
	/// [引数2] 右辺値
	/// [戻り値] 減算算結果のベクル
	//----------------------------------------
	const XMFLOAT3 Sub(const XMFLOAT3& vector1,const XMFLOAT3& vector2);

	//----------------------------------------
	/// [機能]  3次元ベクトルとスカラー乗算
	/// [引数1] 掛けられる3次元ベクトル
	/// [引数2] 掛けるスカラー値
	/// [戻り値] 掛けられた結果のベクトル
	//----------------------------------------
	const XMFLOAT3 MulScaler(const XMFLOAT3& vector,float scaler);

	//----------------------------------------
	/// [機能]  3次元ベクトルとスカラー除算
	/// [引数1] 割られる3次元ベクトル
	/// [引数2] 割るスカラー値
	/// [戻り値] 割られた結果のベクトル
	//----------------------------------------
	const XMFLOAT3 DivScaler(const XMFLOAT3& vector,float scaler);

	//---------------------------------------------
	/// [機能] ベクトルの長さの取得
	/// [引数] 3次元ベクトル
	/// [返り値] ベクトルの長さ
	//---------------------------------------------
	float GetLenght(const XMFLOAT3& vector);

	//---------------------------------------------
	/// [機能] ベクトルの正規化
	/// [引数] 3次元ベクトル
	/// [返り値] 正規化されたベクトル
	//---------------------------------------------
	const XMFLOAT3 GetNormalize(const XMFLOAT3& vector);

	//---------------------------------------------
	/// [機能] ベクトルの内積の取得
	/// [引数1] 3次元ベクトル1つ目
	/// [引数2] 3次元ベクトル2つ目
	/// [戻り値] ベクトルの内積
	//---------------------------------------------
	float GetDot(const XMFLOAT3& vector1, const XMFLOAT3& vector2);


	//----------------------------------------
	/// [機能] 前方ベクトルを取得します
	/// [引数] y軸周りの回転量です(度数方)
	/// [返り値] 前方ベクトルです
	//----------------------------------------
	const XMFLOAT3 GetFront(float rot);
	//----------------------------------------
	/// [機能] 後方ベクトルを取得します
	/// [引数] y軸周りの回転量です(度数方)
	/// [返り値] 後方ベクトルです
	//----------------------------------------
	const XMFLOAT3 GetBack(float rot);
	//----------------------------------------
	/// [機能] 右ベクトルを取得します
	/// [引数] y軸周りの回転量です(度数方)
	/// [返り値] 右ベクトルです
	//----------------------------------------
	const XMFLOAT3 GetRight(float rot);
	//----------------------------------------
	/// [機能] 左ベクトルを取得します
	/// [引数] y軸周りの回転量です(度数方)
	/// [返り値] 左ベクトルです
	//----------------------------------------
	const XMFLOAT3 GetLeft(float rot);

	//---------------------------------------------------------------
	/// [機能] 二つの引数がほぼ同じならtrueを返します(foat用)
	/// [引数1] 比べたい数値です
	/// [引数2] 引数1と比べる数値です
	/// [返り値] 引数1と引数2がほぼ同じならtrueを返します
	//---------------------------------------------------------------
	bool NearEqualF(float num1,float num2);

	//---------------------------------------------------------------
	/// [機能] 引数の絶対値を得る(float用)
	/// [引数] 絶対値をとる元の数字
	/// [返り値] 引数の絶対値
	//----------------------------------------------------------------
	float AbsoluteValue(float num);
}
