#pragma once


class Sequence {
public:
	Sequence();
	~Sequence();

	//=====================================
	// シーンの種類の列挙型です
	//=====================================
	enum SceneType {
		ETitle,
		EGame
	};
	//---------------------------------------------------
	/// [機能] 現在設定されているシーンを開始します
	//---------------------------------------------------
	void RunScene();
	//--------------------------------------------------------
	///[機能] 現在設定されているシーンをsceneTypeに変更します
	///[引数] 変更するシーン名
	//--------------------------------------------------------
	void ChangeScene(SceneType sceneType);


private:
	class Scene* mScene;
	SceneType mSceneType;
};
