#pragma once
#include <vector>
#include "Engine.h"
#include "SharedStruct.h"
#include "AssimpLoader.h"

//=====================================================
/// [機能] オブジェクトのクラスです。
/// 3Dオブジェクトをつくるときはこのクラスを使用します
/// [機能2] 基底クラスとしても使用できます
//=====================================================
class GameObject
{
public:
	enum State {
		EActive,
		EDead,
		EStop,
		EOther
	};
	
	//------------------------------------------------------------------------------
	/// [機能] コンストラクタ。引数を用いてobjectの初期化をします。位置、回転、拡大率を決定できます
	/// [引数１] オブジェクトの見た目(頂点やルートシグネチャなど)のソースです
	/// [引数２] オブジェクトの位置です
	/// [引数３] オブジェクトの回転角(度数法)です
	/// [引数４] オブジェクトの拡大率です
	//------------------------------------------------------------------------------
	GameObject(
		class ObjectResource* resource,
		const DirectX::XMFLOAT3& pos = DirectX::XMFLOAT3(0.0f,0.0f,0.0f),
		const DirectX::XMFLOAT3& rot = DirectX::XMFLOAT3(0.0f,0.0f,0.0f),
		const DirectX::XMFLOAT3& scale = DirectX::XMFLOAT3(1.0f,1.0f,1.0f));

	
	virtual ~GameObject();

	//---------------------------------------------------
	///[機能] オブジェクトの更新をします
	//----------------------------------------------------
	void Update();

	//---------------------------------------------------
	///[機能] 3Dオブジェクトを描画します
	///[引数] view行列です
	//---------------------------------------------------
	void Draw(const class Camera& camera); // 描画処理

	//---------------------------------------------------
	///[機能] オブジェクトを消してしてよいのか取得
	///[戻り値] オブジェクトを消してよいのか
	//---------------------------------------------------
	bool NeedErase();

protected:
	//-------------------------------------------------------------------------------
	/// [機能]  オブジェクト状態の本体更新。Update()のヘルパーのメイン処理部分
	//-------------------------------------------------------------------------------
	virtual void UpdateObject() {};    // 基底では何もしない

	//-------------------------------------------------------------------------------------
	///[機能]  オブジェクトの後処理。vectorの仕様上? デストラクターで上手くいかない
	//-------------------------------------------------------------------------------------
	virtual void ShutDown() {};        // 基底では何もしない

	//----------------------------------------------------
	/// [機能] 位置をposにします
	/// [引数] オブジェクトを置きたい位置です
	//----------------------------------------------------
	void SetPosition(const DirectX::XMFLOAT3& pos);

	//----------------------------------------------------
	/// [機能] オブジェクトの角度をrotに更新します
	/// [引数] オブジェクトの角度
	//----------------------------------------------------
	void SetRotation(const DirectX::XMFLOAT3& rot);

	//----------------------------------------------------
	/// [機能] オブジェクトの拡大率をscaleに変更します
	/// [引数] オブジェクトの拡大率です
	//----------------------------------------------------
	void SetScale(const DirectX::XMFLOAT3& scale);

	//----------------------------------------------------
	/// [機能] オブジェクト状態の更新
	/// [引数] オブジェクトの状態
	//----------------------------------------------------
	void SetState(State state);

	//----------------------------------------------------
	/// [機能] オブジェクトの位置情報を取得します
	/// [返り値] オブジェクトの位置情報です
	//----------------------------------------------------
	const DirectX::XMFLOAT3& GetPosition();


	//----------------------------------------------------
	/// [機能] オブジェクトの角度情報を取得します
	/// [返り値] オブジェクトの角度情報です
	//----------------------------------------------------
	const DirectX::XMFLOAT3& GetRotation();


	//----------------------------------------------------
	/// [機能] オブジェクトの拡大率を取得します
	/// [返り値] オブジェクトの拡大率です
	//----------------------------------------------------
	const DirectX::XMFLOAT3& GetScale();

	//---------------------------------------------------
	///[機能] 状態の取得
	///[戻り値] オブジェクトの状態
	//---------------------------------------------------
	State GetState();

	//----------------------------------------------------
	/// [機能] ワールド行列の更新
	//----------------------------------------------------
	void UpdateWorldMat();

	

private:
	void SetTransform();   // 位置の設定
	void UpdateViewMat(const class Camera& camera);    // ビュー行列の更新

	DirectX::XMFLOAT3 mPosition;     // オブジェクト位置
	DirectX::XMFLOAT3 mRotation;	 // オブジェクトの回転
	DirectX::XMFLOAT3 mScale;        // オブジェクトの拡大率
	State             mState;        // オブジェクトの状態

	class ObjectResource* mResource;   // 見た目などのリソース
	class ConstantBuffer* mTransform[Engine::FRAME_BUFFER_COUNT];    // スクリーンに表示するための行列とか
	bool mNeedUpdateWorldMat;     // ワールド行列の更新が必要あるか
	bool mNeedErase;
};

std::wstring ReplaceExtension(const std::wstring& origin, const char* ext);